NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* LFCLKSTARTED @Bit 2 : Enable or disable interrupt for event LFCLKSTARTED */
  #define CLOCK_INTEN_LFCLKSTARTED_Pos (2UL)         /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTEN_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTEN_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.            */
  #define CLOCK_INTEN_LFCLKSTARTED_Min (0x0UL)       /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTEN_LFCLKSTARTED_Max (0x1UL)       /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTEN_LFCLKSTARTED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define CLOCK_INTEN_LFCLKSTARTED_Enabled (0x1UL)   /*!< Enable                                                               */

/* DONE @Bit 3 : Enable or disable interrupt for event DONE */
  #define CLOCK_INTEN_DONE_Pos (3UL)                 /*!< Position of DONE field.                                              */
  #define CLOCK_INTEN_DONE_Msk (0x1UL << CLOCK_INTEN_DONE_Pos) /*!< Bit mask of DONE field.                                    */
  #define CLOCK_INTEN_DONE_Min (0x0UL)               /*!< Min enumerator value of DONE field.                                  */
  #define CLOCK_INTEN_DONE_Max (0x1UL)               /*!< Max enumerator value of DONE field.                                  */
  #define CLOCK_INTEN_DONE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define CLOCK_INTEN_DONE_Enabled (0x1UL)           /*!< Enable                                                               */

/* XOTUNED @Bit 4 : Enable or disable interrupt for event XOTUNED */
  #define CLOCK_INTEN_XOTUNED_Pos (4UL)              /*!< Position of XOTUNED field.                                           */
  #define CLOCK_INTEN_XOTUNED_Msk (0x1UL << CLOCK_INTEN_XOTUNED_Pos) /*!< Bit mask of XOTUNED field.                           */
  #define CLOCK_INTEN_XOTUNED_Min (0x0UL)            /*!< Min enumerator value of XOTUNED field.                               */
  #define CLOCK_INTEN_XOTUNED_Max (0x1UL)            /*!< Max enumerator value of XOTUNED field.                               */
  #define CLOCK_INTEN_XOTUNED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define CLOCK_INTEN_XOTUNED_Enabled (0x1UL)        /*!< Enable                                                               */

/* XOTUNEERROR @Bit 5 : Enable or disable interrupt for event XOTUNEERROR */
  #define CLOCK_INTEN_XOTUNEERROR_Pos (5UL)          /*!< Position of XOTUNEERROR field.                                       */
  #define CLOCK_INTEN_XOTUNEERROR_Msk (0x1UL << CLOCK_INTEN_XOTUNEERROR_Pos) /*!< Bit mask of XOTUNEERROR field.               */
  #define CLOCK_INTEN_XOTUNEERROR_Min (0x0UL)        /*!< Min enumerator value of XOTUNEERROR field.                           */
  #define CLOCK_INTEN_XOTUNEERROR_Max (0x1UL)        /*!< Max enumerator value of XOTUNEERROR field.                           */
  #define CLOCK_INTEN_XOTUNEERROR_Disabled (0x0UL)   /*!< Disable                                                              */
  #define CLOCK_INTEN_XOTUNEERROR_Enabled (0x1UL)    /*!< Enable                                                               */

/* XOTUNEFAILED @Bit 6 : Enable or disable interrupt for event XOTUNEFAILED */
  #define CLOCK_INTEN_XOTUNEFAILED_Pos (6UL)         /*!< Position of XOTUNEFAILED field.                                      */
  #define CLOCK_INTEN_XOTUNEFAILED_Msk (0x1UL << CLOCK_INTEN_XOTUNEFAILED_Pos) /*!< Bit mask of XOTUNEFAILED field.            */
  #define CLOCK_INTEN_XOTUNEFAILED_Min (0x0UL)       /*!< Min enumerator value of XOTUNEFAILED field.                          */
  #define CLOCK_INTEN_XOTUNEFAILED_Max (0x1UL)       /*!< Max enumerator value of XOTUNEFAILED field.                          */
  #define CLOCK_INTEN_XOTUNEFAILED_Disabled (0x0UL)  /*!< Disable                                                              */
  #define CLOCK_INTEN_XOTUNEFAILED_Enabled (0x1UL)   /*!< Enable                                                               */


/* CLOCK_INTENSET: Enable interrupt */
  #define CLOCK_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* XOSTARTED @Bit 0 : Write '1' to enable interrupt for event XOSTARTED */
  #define CLOCK_INTENSET_XOSTARTED_Pos (0UL)         /*!< Position of XOSTARTED field.                                         */
  #define CLOCK_INTENSET_XOSTARTED_Msk (0x1UL << CLOCK_INTENSET_XOSTARTED_Pos) /*!< Bit mask of XOSTARTED field.               */
  #define CLOCK_INTENSET_XOSTARTED_Min (0x0UL)       /*!< Min enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTENSET_XOSTARTED_Max (0x1UL)       /*!< Max enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTENSET_XOSTARTED_Set (0x1UL)       /*!< Enable                                                               */
  #define CLOCK_INTENSET_XOSTARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define CLOCK_INTENSET_XOSTARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* PLLSTARTED @Bit 1 : Write '1' to enable interrupt for event PLLSTARTED */
  #define CLOCK_INTENSET_PLLSTARTED_Pos (1UL)        /*!< Position of PLLSTARTED field.                                        */
  #define CLOCK_INTENSET_PLLSTARTED_Msk (0x1UL << CLOCK_INTENSET_PLLSTARTED_Pos) /*!< Bit mask of PLLSTARTED field.            */
  #define CLOCK_INTENSET_PLLSTARTED_Min (0x0UL)      /*!< Min enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTENSET_PLLSTARTED_Max (0x1UL)      /*!< Max enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTENSET_PLLSTARTED_Set (0x1UL)      /*!< Enable                                                               */
  #define CLOCK_INTENSET_PLLSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define CLOCK_INTENSET_PLLSTARTED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* LFCLKSTARTED @Bit 2 : Write '1' to enable interrupt for event LFCLKSTARTED */
  #define CLOCK_INTENSET_LFCLKSTARTED_Pos (2UL)      /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTENSET_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTENSET_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.      */
  #define CLOCK_INTENSET_LFCLKSTARTED_Min (0x0UL)    /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENSET_LFCLKSTARTED_Max (0x1UL)    /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENSET_LFCLKSTARTED_Set (0x1UL)    /*!< Enable                                                               */
  #define CLOCK_INTENSET_LFCLKSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CLOCK_INTENSET_LFCLKSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DONE @Bit 3 : Write '1' to enable interrupt for event DONE */
  #define CLOCK_INTENSET_DONE_Pos (3UL)              /*!< Position of DONE field.                                              */
  #define CLOCK_INTENSET_DONE_Msk (0x1UL << CLOCK_INTENSET_DONE_Pos) /*!< Bit mask of DONE field.                              */
  #define CLOCK_INTENSET_DONE_Min (0x0UL)            /*!< Min enumerator value of DONE field.                                  */
  #define CLOCK_INTENSET_DONE_Max (0x1UL)            /*!< Max enumerator value of DONE field.                                  */
  #define CLOCK_INTENSET_DONE_Set (0x1UL)            /*!< Enable                                                               */
  #define CLOCK_INTENSET_DONE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CLOCK_INTENSET_DONE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* XOTUNED @Bit 4 : Write '1' to enable interrupt for event XOTUNED */
  #define CLOCK_INTENSET_XOTUNED_Pos (4UL)           /*!< Position of XOTUNED field.                                           */
  #define CLOCK_INTENSET_XOTUNED_Msk (0x1UL << CLOCK_INTENSET_XOTUNED_Pos) /*!< Bit mask of XOTUNED field.                     */
  #define CLOCK_INTENSET_XOTUNED_Min (0x0UL)         /*!< Min enumerator value of XOTUNED field.                               */
  #define CLOCK_INTENSET_XOTUNED_Max (0x1UL)         /*!< Max enumerator value of XOTUNED field.                               */
  #define CLOCK_INTENSET_XOTUNED_Set (0x1UL)         /*!< Enable                                                               */
  #define CLOCK_INTENSET_XOTUNED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CLOCK_INTENSET_XOTUNED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* XOTUNEERROR @Bit 5 : Write '1' to enable interrupt for event XOTUNEERROR */
  #define CLOCK_INTENSET_XOTUNEERROR_Pos (5UL)       /*!< Position of XOTUNEERROR field.                                       */
  #define CLOCK_INTENSET_XOTUNEERROR_Msk (0x1UL << CLOCK_INTENSET_XOTUNEERROR_Pos) /*!< Bit mask of XOTUNEERROR field.         */
  #define CLOCK_INTENSET_XOTUNEERROR_Min (0x0UL)     /*!< Min enumerator value of XOTUNEERROR field.                           */
  #define CLOCK_INTENSET_XOTUNEERROR_Max (0x1UL)     /*!< Max enumerator value of XOTUNEERROR field.                           */
  #define CLOCK_INTENSET_XOTUNEERROR_Set (0x1UL)     /*!< Enable                                                               */
  #define CLOCK_INTENSET_XOTUNEERROR_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define CLOCK_INTENSET_XOTUNEERROR_Enabled (0x1UL) /*!< Read: Enabled                                                        */

