NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* BA419SM4INCLUDED @Bit 8 : Generic g_IncludeSM4 value. */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA419SM4INCLUDED_Pos (8UL) /*!< Position of BA419SM4INCLUDED field.              */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA419SM4INCLUDED_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA419SM4INCLUDED_Pos)
                                                                            /*!< Bit mask of BA419SM4INCLUDED field.*/

/* BA414EPPKEINCLUDED @Bit 9 : Generic g_IncludePKE value. */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA414EPPKEINCLUDED_Pos (9UL) /*!< Position of BA414EPPKEINCLUDED field.          */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA414EPPKEINCLUDED_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA414EPPKEINCLUDED_Pos)
                                                                            /*!< Bit mask of BA414EPPKEINCLUDED field.*/

/* BA431NDRNGINCLUDED @Bit 10 : Generic g_IncludeNDRNG value. */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA431NDRNGINCLUDED_Pos (10UL) /*!< Position of BA431NDRNGINCLUDED field.         */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA431NDRNGINCLUDED_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA431NDRNGINCLUDED_Pos)
                                                                            /*!< Bit mask of BA431NDRNGINCLUDED field.*/

/* BA420HPCHACHAPOLYINCLUDED @Bit 11 : Generic g_IncludeHPChachaPoly value. */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA420HPCHACHAPOLYINCLUDED_Pos (11UL) /*!< Position of BA420HPCHACHAPOLYINCLUDED
                                                                            field.*/
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA420HPCHACHAPOLYINCLUDED_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA420HPCHACHAPOLYINCLUDED_Pos)
                                                                            /*!< Bit mask of BA420HPCHACHAPOLYINCLUDED field.*/

/* BA423SNOW3GINCLUDED @Bit 12 : Generic g_IncludeSnow3G value. */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA423SNOW3GINCLUDED_Pos (12UL) /*!< Position of BA423SNOW3GINCLUDED field.       */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA423SNOW3GINCLUDED_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA423SNOW3GINCLUDED_Pos)
                                                                            /*!< Bit mask of BA423SNOW3GINCLUDED field.*/

/* BA422KASUMIINCLUDED @Bit 13 : Generic g_IncludeKasumi value. */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA422KASUMIINCLUDED_Pos (13UL) /*!< Position of BA422KASUMIINCLUDED field.       */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA422KASUMIINCLUDED_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA422KASUMIINCLUDED_Pos)
                                                                            /*!< Bit mask of BA422KASUMIINCLUDED field.*/

/* BA422ARIAINCLUDED @Bit 14 : Generic g_IncludeAria value. */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA422ARIAINCLUDED_Pos (14UL) /*!< Position of BA422ARIAINCLUDED field.           */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA422ARIAINCLUDED_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA422ARIAINCLUDED_Pos)
                                                                            /*!< Bit mask of BA422ARIAINCLUDED field.*/


/* CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1: Generic g_AesModesPoss value. */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_ResetValue (0x05020167UL) /*!< Reset value of BA411EAESHWCFG1 register.       */

/* BA411EAESHWCFGMODE @Bits 0..8 : Generic g_AesModesPoss value. */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMODE_Pos (0UL) /*!< Position of BA411EAESHWCFGMODE field.       */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMODE_Msk (0x1FFUL << CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMODE_Pos)
                                                                            /*!< Bit mask of BA411EAESHWCFGMODE field.*/

/* BA411EAESHWCFGCS @Bit 16 : Generic g_CS value. */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGCS_Pos (16UL) /*!< Position of BA411EAESHWCFGCS field.          */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGCS_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGCS_Pos)
                                                                            /*!< Bit mask of BA411EAESHWCFGCS field.*/

/* BA411EAESHWCFGMASKING @Bit 17 : Generic g_UseMasking value. */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMASKING_Pos (17UL) /*!< Position of BA411EAESHWCFGMASKING field.*/
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMASKING_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGMASKING_Pos)
                                                                            /*!< Bit mask of BA411EAESHWCFGMASKING field.*/

/* BA411EAESHWCFGKEYSIZE @Bits 24..26 : Generic g_Keysize value. */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGKEYSIZE_Pos (24UL) /*!< Position of BA411EAESHWCFGKEYSIZE field.*/
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGKEYSIZE_Msk (0x7UL << CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_BA411EAESHWCFGKEYSIZE_Pos)
                                                                            /*!< Bit mask of BA411EAESHWCFGKEYSIZE field.*/

/* CONTEXTEN @Bit 27 : Generic g_CxSwitch value. */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_CONTEXTEN_Pos (27UL) /*!< Position of CONTEXTEN field.                        */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_CONTEXTEN_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_CONTEXTEN_Pos)
                                                                            /*!< Bit mask of CONTEXTEN field.*/

/* GLITCHPROT @Bit 28 : Generic g_GlitchProtection value. */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_GLITCHPROT_Pos (28UL) /*!< Position of GLITCHPROT field.                      */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_GLITCHPROT_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG1_GLITCHPROT_Pos)
                                                                            /*!< Bit mask of GLITCHPROT field.*/


/* CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG2: Generic g_CtrSize value. */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG2_ResetValue (0x02000010UL) /*!< Reset value of BA411EAESHWCFG2 register.       */

/* BA411EAESHWCFG2 @Bits 0..15 : Generic g_CtrSize value. */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG2_BA411EAESHWCFG2_Pos (0UL) /*!< Position of BA411EAESHWCFG2 field.             */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG2_BA411EAESHWCFG2_Msk (0xFFFFUL << CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG2_BA411EAESHWCFG2_Pos)
                                                                            /*!< Bit mask of BA411EAESHWCFG2 field.*/

/* NBEXTAESKEYS @Bits 20..23 : Generic g_Ext_nb_AES_keys value. */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG2_NBEXTAESKEYS_Pos (20UL) /*!< Position of NBEXTAESKEYS field.                  */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG2_NBEXTAESKEYS_Msk (0xFUL << CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG2_NBEXTAESKEYS_Pos)
                                                                            /*!< Bit mask of NBEXTAESKEYS field.*/

/* NBIKGAESKEYS @Bits 24..27 : Generic g_IKG_nb_AES_keys value. */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG2_NBIKGAESKEYS_Pos (24UL) /*!< Position of NBIKGAESKEYS field.                  */
  #define CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG2_NBIKGAESKEYS_Msk (0xFUL << CRACENCORE_CRYPTMSTRHW_BA411EAESHWCFG2_NBIKGAESKEYS_Pos)
                                                                            /*!< Bit mask of NBIKGAESKEYS field.*/


/* CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG: Generic g_Hash value */
  #define CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_ResetValue (0x0001003EUL) /*!< Reset value of BA413HASHHWCFG register.         */

/* BA413HASHHWCFGMASK @Bits 0..6 : Generic g_HashMaskFunc value. */
  #define CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGMASK_Pos (0UL) /*!< Position of BA413HASHHWCFGMASK field.        */
  #define CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGMASK_Msk (0x7FUL << CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGMASK_Pos)
                                                                            /*!< Bit mask of BA413HASHHWCFGMASK field.*/

/* BA413HASHHWCFGPADDING @Bit 16 : Generic g_HashPadding value. */
  #define CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGPADDING_Pos (16UL) /*!< Position of BA413HASHHWCFGPADDING field. */
  #define CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGPADDING_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGPADDING_Pos)
                                                                            /*!< Bit mask of BA413HASHHWCFGPADDING field.*/

/* BA413HASHHWCFGHMAC @Bit 17 : Generic g_HMAC_enabled value. */
  #define CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGHMAC_Pos (17UL) /*!< Position of BA413HASHHWCFGHMAC field.       */
  #define CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGHMAC_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGHMAC_Pos)
                                                                            /*!< Bit mask of BA413HASHHWCFGHMAC field.*/

/* BA413HASHHWCFGVERIFYDIGEST @Bit 18 : Generic g_HashVerifyDigest value. */
  #define CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGVERIFYDIGEST_Pos (18UL) /*!< Position of
                                                                            BA413HASHHWCFGVERIFYDIGEST field.*/
  #define CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGVERIFYDIGEST_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_BA413HASHHWCFGVERIFYDIGEST_Pos)
                                                                            /*!< Bit mask of BA413HASHHWCFGVERIFYDIGEST field.*/

/* NBEXTHASHKEYS @Bits 20..23 : Generic g_Ext_nb_Hash_keys value. */
  #define CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_NBEXTHASHKEYS_Pos (20UL) /*!< Position of NBEXTHASHKEYS field.                 */
  #define CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_NBEXTHASHKEYS_Msk (0xFUL << CRACENCORE_CRYPTMSTRHW_BA413HASHHWCFG_NBEXTHASHKEYS_Pos)
                                                                            /*!< Bit mask of NBEXTHASHKEYS field.*/

