NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* START6 @Bit 6 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START6_Pos (6UL)           /*!< Position of START6 field.                                            */
  #define ETM_TRCVISSCTLR_START6_Msk (0x1UL << ETM_TRCVISSCTLR_START6_Pos) /*!< Bit mask of START6 field.                      */
  #define ETM_TRCVISSCTLR_START6_Min (0x0UL)         /*!< Min enumerator value of START6 field.                                */
  #define ETM_TRCVISSCTLR_START6_Max (0x1UL)         /*!< Max enumerator value of START6 field.                                */
  #define ETM_TRCVISSCTLR_START6_Disabled (0x0UL)    /*!< The single address comparator 6, is not selected as a start resource.*/
  #define ETM_TRCVISSCTLR_START6_Enabled (0x1UL)     /*!< The single address comparator 6, is selected as a start resource.    */

/* START7 @Bit 7 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START7_Pos (7UL)           /*!< Position of START7 field.                                            */
  #define ETM_TRCVISSCTLR_START7_Msk (0x1UL << ETM_TRCVISSCTLR_START7_Pos) /*!< Bit mask of START7 field.                      */
  #define ETM_TRCVISSCTLR_START7_Min (0x0UL)         /*!< Min enumerator value of START7 field.                                */
  #define ETM_TRCVISSCTLR_START7_Max (0x1UL)         /*!< Max enumerator value of START7 field.                                */
  #define ETM_TRCVISSCTLR_START7_Disabled (0x0UL)    /*!< The single address comparator 7, is not selected as a start resource.*/
  #define ETM_TRCVISSCTLR_START7_Enabled (0x1UL)     /*!< The single address comparator 7, is selected as a start resource.    */

/* STOP0 @Bit 16 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP0_Pos (16UL)           /*!< Position of STOP0 field.                                             */
  #define ETM_TRCVISSCTLR_STOP0_Msk (0x1UL << ETM_TRCVISSCTLR_STOP0_Pos) /*!< Bit mask of STOP0 field.                         */
  #define ETM_TRCVISSCTLR_STOP0_Min (0x0UL)          /*!< Min enumerator value of STOP0 field.                                 */
  #define ETM_TRCVISSCTLR_STOP0_Max (0x1UL)          /*!< Max enumerator value of STOP0 field.                                 */
  #define ETM_TRCVISSCTLR_STOP0_Disabled (0x0UL)     /*!< The single address comparator 0, is not selected as a stop resource. */
  #define ETM_TRCVISSCTLR_STOP0_Enabled (0x1UL)      /*!< The single address comparator 0, is selected as a stop resource.     */

/* STOP1 @Bit 17 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP1_Pos (17UL)           /*!< Position of STOP1 field.                                             */
  #define ETM_TRCVISSCTLR_STOP1_Msk (0x1UL << ETM_TRCVISSCTLR_STOP1_Pos) /*!< Bit mask of STOP1 field.                         */
  #define ETM_TRCVISSCTLR_STOP1_Min (0x0UL)          /*!< Min enumerator value of STOP1 field.                                 */
  #define ETM_TRCVISSCTLR_STOP1_Max (0x1UL)          /*!< Max enumerator value of STOP1 field.                                 */
  #define ETM_TRCVISSCTLR_STOP1_Disabled (0x0UL)     /*!< The single address comparator 1, is not selected as a stop resource. */
  #define ETM_TRCVISSCTLR_STOP1_Enabled (0x1UL)      /*!< The single address comparator 1, is selected as a stop resource.     */

/* STOP2 @Bit 18 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP2_Pos (18UL)           /*!< Position of STOP2 field.                                             */
  #define ETM_TRCVISSCTLR_STOP2_Msk (0x1UL << ETM_TRCVISSCTLR_STOP2_Pos) /*!< Bit mask of STOP2 field.                         */
  #define ETM_TRCVISSCTLR_STOP2_Min (0x0UL)          /*!< Min enumerator value of STOP2 field.                                 */
  #define ETM_TRCVISSCTLR_STOP2_Max (0x1UL)          /*!< Max enumerator value of STOP2 field.                                 */
  #define ETM_TRCVISSCTLR_STOP2_Disabled (0x0UL)     /*!< The single address comparator 2, is not selected as a stop resource. */
  #define ETM_TRCVISSCTLR_STOP2_Enabled (0x1UL)      /*!< The single address comparator 2, is selected as a stop resource.     */

/* STOP3 @Bit 19 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP3_Pos (19UL)           /*!< Position of STOP3 field.                                             */
  #define ETM_TRCVISSCTLR_STOP3_Msk (0x1UL << ETM_TRCVISSCTLR_STOP3_Pos) /*!< Bit mask of STOP3 field.                         */
  #define ETM_TRCVISSCTLR_STOP3_Min (0x0UL)          /*!< Min enumerator value of STOP3 field.                                 */
  #define ETM_TRCVISSCTLR_STOP3_Max (0x1UL)          /*!< Max enumerator value of STOP3 field.                                 */
  #define ETM_TRCVISSCTLR_STOP3_Disabled (0x0UL)     /*!< The single address comparator 3, is not selected as a stop resource. */
  #define ETM_TRCVISSCTLR_STOP3_Enabled (0x1UL)      /*!< The single address comparator 3, is selected as a stop resource.     */

/* STOP4 @Bit 20 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP4_Pos (20UL)           /*!< Position of STOP4 field.                                             */
  #define ETM_TRCVISSCTLR_STOP4_Msk (0x1UL << ETM_TRCVISSCTLR_STOP4_Pos) /*!< Bit mask of STOP4 field.                         */
  #define ETM_TRCVISSCTLR_STOP4_Min (0x0UL)          /*!< Min enumerator value of STOP4 field.                                 */
  #define ETM_TRCVISSCTLR_STOP4_Max (0x1UL)          /*!< Max enumerator value of STOP4 field.                                 */
  #define ETM_TRCVISSCTLR_STOP4_Disabled (0x0UL)     /*!< The single address comparator 4, is not selected as a stop resource. */
  #define ETM_TRCVISSCTLR_STOP4_Enabled (0x1UL)      /*!< The single address comparator 4, is selected as a stop resource.     */

/* STOP5 @Bit 21 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP5_Pos (21UL)           /*!< Position of STOP5 field.                                             */
  #define ETM_TRCVISSCTLR_STOP5_Msk (0x1UL << ETM_TRCVISSCTLR_STOP5_Pos) /*!< Bit mask of STOP5 field.                         */
  #define ETM_TRCVISSCTLR_STOP5_Min (0x0UL)          /*!< Min enumerator value of STOP5 field.                                 */
  #define ETM_TRCVISSCTLR_STOP5_Max (0x1UL)          /*!< Max enumerator value of STOP5 field.                                 */
  #define ETM_TRCVISSCTLR_STOP5_Disabled (0x0UL)     /*!< The single address comparator 5, is not selected as a stop resource. */
  #define ETM_TRCVISSCTLR_STOP5_Enabled (0x1UL)      /*!< The single address comparator 5, is selected as a stop resource.     */

/* STOP6 @Bit 22 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP6_Pos (22UL)           /*!< Position of STOP6 field.                                             */
  #define ETM_TRCVISSCTLR_STOP6_Msk (0x1UL << ETM_TRCVISSCTLR_STOP6_Pos) /*!< Bit mask of STOP6 field.                         */
  #define ETM_TRCVISSCTLR_STOP6_Min (0x0UL)          /*!< Min enumerator value of STOP6 field.                                 */
  #define ETM_TRCVISSCTLR_STOP6_Max (0x1UL)          /*!< Max enumerator value of STOP6 field.                                 */
  #define ETM_TRCVISSCTLR_STOP6_Disabled (0x0UL)     /*!< The single address comparator 6, is not selected as a stop resource. */
  #define ETM_TRCVISSCTLR_STOP6_Enabled (0x1UL)      /*!< The single address comparator 6, is selected as a stop resource.     */

/* STOP7 @Bit 23 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP7_Pos (23UL)           /*!< Position of STOP7 field.                                             */
  #define ETM_TRCVISSCTLR_STOP7_Msk (0x1UL << ETM_TRCVISSCTLR_STOP7_Pos) /*!< Bit mask of STOP7 field.                         */
  #define ETM_TRCVISSCTLR_STOP7_Min (0x0UL)          /*!< Min enumerator value of STOP7 field.                                 */
  #define ETM_TRCVISSCTLR_STOP7_Max (0x1UL)          /*!< Max enumerator value of STOP7 field.                                 */
  #define ETM_TRCVISSCTLR_STOP7_Disabled (0x0UL)     /*!< The single address comparator 7, is not selected as a stop resource. */
  #define ETM_TRCVISSCTLR_STOP7_Enabled (0x1UL)      /*!< The single address comparator 7, is selected as a stop resource.     */


/* ETM_TRCVIPCSSCTLR: Use this to set, or read, which PE comparator inputs can control the ViewInst start/stop logic. Might
                       ignore writes when the trace unit is enabled or not idle. If implemented then this register must be
                       programmed. */

  #define ETM_TRCVIPCSSCTLR_ResetValue (0x00000000UL) /*!< Reset value of TRCVIPCSSCTLR register.                              */

/* START0 @Bit 0 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START0_Pos (0UL)         /*!< Position of START0 field.                                            */
  #define ETM_TRCVIPCSSCTLR_START0_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START0_Pos) /*!< Bit mask of START0 field.                  */
  #define ETM_TRCVIPCSSCTLR_START0_Min (0x0UL)       /*!< Min enumerator value of START0 field.                                */
  #define ETM_TRCVIPCSSCTLR_START0_Max (0x1UL)       /*!< Max enumerator value of START0 field.                                */
  #define ETM_TRCVIPCSSCTLR_START0_Disabled (0x0UL)  /*!< The single PE comparator input 0, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START0_Enabled (0x1UL)   /*!< The single PE comparator input 0, is selected as a start resource.   */

/* START1 @Bit 1 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START1_Pos (1UL)         /*!< Position of START1 field.                                            */
  #define ETM_TRCVIPCSSCTLR_START1_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START1_Pos) /*!< Bit mask of START1 field.                  */
  #define ETM_TRCVIPCSSCTLR_START1_Min (0x0UL)       /*!< Min enumerator value of START1 field.                                */
  #define ETM_TRCVIPCSSCTLR_START1_Max (0x1UL)       /*!< Max enumerator value of START1 field.                                */
  #define ETM_TRCVIPCSSCTLR_START1_Disabled (0x0UL)  /*!< The single PE comparator input 1, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START1_Enabled (0x1UL)   /*!< The single PE comparator input 1, is selected as a start resource.   */

/* START2 @Bit 2 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START2_Pos (2UL)         /*!< Position of START2 field.                                            */
  #define ETM_TRCVIPCSSCTLR_START2_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START2_Pos) /*!< Bit mask of START2 field.                  */
  #define ETM_TRCVIPCSSCTLR_START2_Min (0x0UL)       /*!< Min enumerator value of START2 field.                                */
  #define ETM_TRCVIPCSSCTLR_START2_Max (0x1UL)       /*!< Max enumerator value of START2 field.                                */
  #define ETM_TRCVIPCSSCTLR_START2_Disabled (0x0UL)  /*!< The single PE comparator input 2, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START2_Enabled (0x1UL)   /*!< The single PE comparator input 2, is selected as a start resource.   */

/* START3 @Bit 3 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START3_Pos (3UL)         /*!< Position of START3 field.                                            */
  #define ETM_TRCVIPCSSCTLR_START3_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START3_Pos) /*!< Bit mask of START3 field.                  */
  #define ETM_TRCVIPCSSCTLR_START3_Min (0x0UL)       /*!< Min enumerator value of START3 field.                                */
  #define ETM_TRCVIPCSSCTLR_START3_Max (0x1UL)       /*!< Max enumerator value of START3 field.                                */
  #define ETM_TRCVIPCSSCTLR_START3_Disabled (0x0UL)  /*!< The single PE comparator input 3, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START3_Enabled (0x1UL)   /*!< The single PE comparator input 3, is selected as a start resource.   */

/* START4 @Bit 4 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START4_Pos (4UL)         /*!< Position of START4 field.                                            */
  #define ETM_TRCVIPCSSCTLR_START4_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START4_Pos) /*!< Bit mask of START4 field.                  */
  #define ETM_TRCVIPCSSCTLR_START4_Min (0x0UL)       /*!< Min enumerator value of START4 field.                                */
  #define ETM_TRCVIPCSSCTLR_START4_Max (0x1UL)       /*!< Max enumerator value of START4 field.                                */
  #define ETM_TRCVIPCSSCTLR_START4_Disabled (0x0UL)  /*!< The single PE comparator input 4, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START4_Enabled (0x1UL)   /*!< The single PE comparator input 4, is selected as a start resource.   */

/* START5 @Bit 5 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START5_Pos (5UL)         /*!< Position of START5 field.                                            */
  #define ETM_TRCVIPCSSCTLR_START5_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START5_Pos) /*!< Bit mask of START5 field.                  */
  #define ETM_TRCVIPCSSCTLR_START5_Min (0x0UL)       /*!< Min enumerator value of START5 field.                                */
  #define ETM_TRCVIPCSSCTLR_START5_Max (0x1UL)       /*!< Max enumerator value of START5 field.                                */
  #define ETM_TRCVIPCSSCTLR_START5_Disabled (0x0UL)  /*!< The single PE comparator input 5, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START5_Enabled (0x1UL)   /*!< The single PE comparator input 5, is selected as a start resource.   */

/* START6 @Bit 6 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

