NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* PIN23 @Bit 23 : Pin 23 */
  #define GPIO_DIR_PIN23_Pos (23UL)                  /*!< Position of PIN23 field.                                             */
  #define GPIO_DIR_PIN23_Msk (0x1UL << GPIO_DIR_PIN23_Pos) /*!< Bit mask of PIN23 field.                                       */
  #define GPIO_DIR_PIN23_Min (0x0UL)                 /*!< Min enumerator value of PIN23 field.                                 */
  #define GPIO_DIR_PIN23_Max (0x1UL)                 /*!< Max enumerator value of PIN23 field.                                 */
  #define GPIO_DIR_PIN23_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN23_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN24 @Bit 24 : Pin 24 */
  #define GPIO_DIR_PIN24_Pos (24UL)                  /*!< Position of PIN24 field.                                             */
  #define GPIO_DIR_PIN24_Msk (0x1UL << GPIO_DIR_PIN24_Pos) /*!< Bit mask of PIN24 field.                                       */
  #define GPIO_DIR_PIN24_Min (0x0UL)                 /*!< Min enumerator value of PIN24 field.                                 */
  #define GPIO_DIR_PIN24_Max (0x1UL)                 /*!< Max enumerator value of PIN24 field.                                 */
  #define GPIO_DIR_PIN24_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN24_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN25 @Bit 25 : Pin 25 */
  #define GPIO_DIR_PIN25_Pos (25UL)                  /*!< Position of PIN25 field.                                             */
  #define GPIO_DIR_PIN25_Msk (0x1UL << GPIO_DIR_PIN25_Pos) /*!< Bit mask of PIN25 field.                                       */
  #define GPIO_DIR_PIN25_Min (0x0UL)                 /*!< Min enumerator value of PIN25 field.                                 */
  #define GPIO_DIR_PIN25_Max (0x1UL)                 /*!< Max enumerator value of PIN25 field.                                 */
  #define GPIO_DIR_PIN25_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN25_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN26 @Bit 26 : Pin 26 */
  #define GPIO_DIR_PIN26_Pos (26UL)                  /*!< Position of PIN26 field.                                             */
  #define GPIO_DIR_PIN26_Msk (0x1UL << GPIO_DIR_PIN26_Pos) /*!< Bit mask of PIN26 field.                                       */
  #define GPIO_DIR_PIN26_Min (0x0UL)                 /*!< Min enumerator value of PIN26 field.                                 */
  #define GPIO_DIR_PIN26_Max (0x1UL)                 /*!< Max enumerator value of PIN26 field.                                 */
  #define GPIO_DIR_PIN26_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN26_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN27 @Bit 27 : Pin 27 */
  #define GPIO_DIR_PIN27_Pos (27UL)                  /*!< Position of PIN27 field.                                             */
  #define GPIO_DIR_PIN27_Msk (0x1UL << GPIO_DIR_PIN27_Pos) /*!< Bit mask of PIN27 field.                                       */
  #define GPIO_DIR_PIN27_Min (0x0UL)                 /*!< Min enumerator value of PIN27 field.                                 */
  #define GPIO_DIR_PIN27_Max (0x1UL)                 /*!< Max enumerator value of PIN27 field.                                 */
  #define GPIO_DIR_PIN27_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN27_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN28 @Bit 28 : Pin 28 */
  #define GPIO_DIR_PIN28_Pos (28UL)                  /*!< Position of PIN28 field.                                             */
  #define GPIO_DIR_PIN28_Msk (0x1UL << GPIO_DIR_PIN28_Pos) /*!< Bit mask of PIN28 field.                                       */
  #define GPIO_DIR_PIN28_Min (0x0UL)                 /*!< Min enumerator value of PIN28 field.                                 */
  #define GPIO_DIR_PIN28_Max (0x1UL)                 /*!< Max enumerator value of PIN28 field.                                 */
  #define GPIO_DIR_PIN28_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN28_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN29 @Bit 29 : Pin 29 */
  #define GPIO_DIR_PIN29_Pos (29UL)                  /*!< Position of PIN29 field.                                             */
  #define GPIO_DIR_PIN29_Msk (0x1UL << GPIO_DIR_PIN29_Pos) /*!< Bit mask of PIN29 field.                                       */
  #define GPIO_DIR_PIN29_Min (0x0UL)                 /*!< Min enumerator value of PIN29 field.                                 */
  #define GPIO_DIR_PIN29_Max (0x1UL)                 /*!< Max enumerator value of PIN29 field.                                 */
  #define GPIO_DIR_PIN29_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN29_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN30 @Bit 30 : Pin 30 */
  #define GPIO_DIR_PIN30_Pos (30UL)                  /*!< Position of PIN30 field.                                             */
  #define GPIO_DIR_PIN30_Msk (0x1UL << GPIO_DIR_PIN30_Pos) /*!< Bit mask of PIN30 field.                                       */
  #define GPIO_DIR_PIN30_Min (0x0UL)                 /*!< Min enumerator value of PIN30 field.                                 */
  #define GPIO_DIR_PIN30_Max (0x1UL)                 /*!< Max enumerator value of PIN30 field.                                 */
  #define GPIO_DIR_PIN30_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN30_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN31 @Bit 31 : Pin 31 */
  #define GPIO_DIR_PIN31_Pos (31UL)                  /*!< Position of PIN31 field.                                             */
  #define GPIO_DIR_PIN31_Msk (0x1UL << GPIO_DIR_PIN31_Pos) /*!< Bit mask of PIN31 field.                                       */
  #define GPIO_DIR_PIN31_Min (0x0UL)                 /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_DIR_PIN31_Max (0x1UL)                 /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_DIR_PIN31_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN31_Output (0x1UL)              /*!< Pin set as output                                                    */


