NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* GPIOHSPADCTRL_BIAS: Bias control */
  #define GPIOHSPADCTRL_BIAS_ResetValue (0x00000000UL) /*!< Reset value of BIAS register.                                      */

/* HSBIAS @Bits 0..1 : Bias setting for high-speed pad */
  #define GPIOHSPADCTRL_BIAS_HSBIAS_Pos (0UL)        /*!< Position of HSBIAS field.                                            */
  #define GPIOHSPADCTRL_BIAS_HSBIAS_Msk (0x3UL << GPIOHSPADCTRL_BIAS_HSBIAS_Pos) /*!< Bit mask of HSBIAS field.                */

/* REPLICABIAS @Bit 2 : Bias setting for replica pad */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS_Pos (2UL)   /*!< Position of REPLICABIAS field.                                       */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS_Msk (0x1UL << GPIOHSPADCTRL_BIAS_REPLICABIAS_Pos) /*!< Bit mask of REPLICABIAS field. */


/* GPIOHSPADCTRL_OVERRIDE: Override control */
  #define GPIOHSPADCTRL_OVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of OVERRIDE register.                              */

/* FORCEON @Bit 0 : Force on */
  #define GPIOHSPADCTRL_OVERRIDE_FORCEON_Pos (0UL)   /*!< Position of FORCEON field.                                           */
  #define GPIOHSPADCTRL_OVERRIDE_FORCEON_Msk (0x1UL << GPIOHSPADCTRL_OVERRIDE_FORCEON_Pos) /*!< Bit mask of FORCEON field.     */

/* ATB0 @Bits 1..3 : ATB0 settings */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_Pos (1UL)      /*!< Position of ATB0 field.                                              */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_Msk (0x7UL << GPIOHSPADCTRL_OVERRIDE_ATB0_Pos) /*!< Bit mask of ATB0 field.              */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_Min (0x5UL)    /*!< Min enumerator value of ATB0 field.                                  */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_Max (0x7UL)    /*!< Max enumerator value of ATB0 field.                                  */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_BiasTrim (0x7UL) /*!< (unspecified)                                                      */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_BiasSupply (0x6UL) /*!< (unspecified)                                                    */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_BiasPTAT (0x5UL) /*!< (unspecified)                                                      */

/* DUALDRIVE @Bit 4 : Drive pad from both high-speed pad and regular pad (when highspeed is enabled) */
  #define GPIOHSPADCTRL_OVERRIDE_DUALDRIVE_Pos (4UL) /*!< Position of DUALDRIVE field.                                         */
  #define GPIOHSPADCTRL_OVERRIDE_DUALDRIVE_Msk (0x1UL << GPIOHSPADCTRL_OVERRIDE_DUALDRIVE_Pos) /*!< Bit mask of DUALDRIVE
                                                                            field.*/


/* GPIOHSPADCTRL_CTRL: HS pad control register */
  #define GPIOHSPADCTRL_CTRL_ResetValue (0x00000000UL) /*!< Reset value of CTRL register.                                      */

/* RXDELAY @Bits 0..2 : RXDELAY setting */
  #define GPIOHSPADCTRL_CTRL_RXDELAY_Pos (0UL)       /*!< Position of RXDELAY field.                                           */
  #define GPIOHSPADCTRL_CTRL_RXDELAY_Msk (0x7UL << GPIOHSPADCTRL_CTRL_RXDELAY_Pos) /*!< Bit mask of RXDELAY field.             */

/* SCKEN @Bit 3 : Enable SCK */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Pos (3UL)         /*!< Position of SCKEN field.                                             */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Msk (0x1UL << GPIOHSPADCTRL_CTRL_SCKEN_Pos) /*!< Bit mask of SCKEN field.                   */

/* SCKPHASE @Bit 4 : SCK phase */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Pos (4UL)      /*!< Position of SCKPHASE field.                                          */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Msk (0x1UL << GPIOHSPADCTRL_CTRL_SCKPHASE_Pos) /*!< Bit mask of SCKPHASE field.          */

/* CSNEN @Bit 5 : CSN enable */
  #define GPIOHSPADCTRL_CTRL_CSNEN_Pos (5UL)         /*!< Position of CSNEN field.                                             */
  #define GPIOHSPADCTRL_CTRL_CSNEN_Msk (0x1UL << GPIOHSPADCTRL_CTRL_CSNEN_Pos) /*!< Bit mask of CSNEN field.                   */

/* DATAENABLE @Bits 6..9 : Enable re-clocking for data bit 0-3 through pad-sync module */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Pos (6UL)    /*!< Position of DATAENABLE field.                                        */
  #define GPIOHSPADCTRL_CTRL_DATAENABLE_Msk (0xFUL << GPIOHSPADCTRL_CTRL_DATAENABLE_Pos) /*!< Bit mask of DATAENABLE field.    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                       GPIOINTERNAL                                       ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* =================================================== Struct GPIOINTERNAL =================================================== */
/**
  * @brief GPIO Internal
  */
  typedef struct {                                   /*!< GPIOINTERNAL Structure                                               */
    __IM uint32_t RESERVED;
  } NRF_GPIOINTERNAL_Type;                           /*!< Size = 4 (0x004)                                                     */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          GPIOTE                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct GPIOTE_EVENTS_PORT ================================================ */
/**
  * @brief EVENTS_PORT [GPIOTE_EVENTS_PORT] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  NONSECURE;                         /*!< (@ 0x00000000) Non-secure port event from owner n                    */
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Secure port event from owner n                        */
} NRF_GPIOTE_EVENTS_PORT_Type;                       /*!< Size = 8 (0x008)                                                     */
