NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* GRTC_CC_CCL: The lower 32-bits of Capture/Compare register CC[n] */
  #define GRTC_CC_CCL_ResetValue (0x00000000UL)      /*!< Reset value of CCL register.                                         */

/* CCL @Bits 0..31 : Capture/Compare low value in 1 us */
  #define GRTC_CC_CCL_CCL_Pos (0UL)                  /*!< Position of CCL field.                                               */
  #define GRTC_CC_CCL_CCL_Msk (0xFFFFFFFFUL << GRTC_CC_CCL_CCL_Pos) /*!< Bit mask of CCL field.                                */


/* GRTC_CC_CCH: The higher 32-bits of Capture/Compare register CC[n] */
  #define GRTC_CC_CCH_ResetValue (0x00000000UL)      /*!< Reset value of CCH register.                                         */

/* CCH @Bits 0..19 : Capture/Compare high value in 1 us */
  #define GRTC_CC_CCH_CCH_Pos (0UL)                  /*!< Position of CCH field.                                               */
  #define GRTC_CC_CCH_CCH_Msk (0xFFFFFUL << GRTC_CC_CCH_CCH_Pos) /*!< Bit mask of CCH field.                                   */


/* GRTC_CC_CCADD: Count to add to CC[n] when this register is written. */
  #define GRTC_CC_CCADD_ResetValue (0x00000000UL)    /*!< Reset value of CCADD register.                                       */

/* VALUE @Bits 0..30 : Count to add to CC[n] */
  #define GRTC_CC_CCADD_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define GRTC_CC_CCADD_VALUE_Msk (0x7FFFFFFFUL << GRTC_CC_CCADD_VALUE_Pos) /*!< Bit mask of VALUE field.                      */

/* REFERENCE @Bit 31 : Configure the Capture/Compare register */
  #define GRTC_CC_CCADD_REFERENCE_Pos (31UL)         /*!< Position of REFERENCE field.                                         */
  #define GRTC_CC_CCADD_REFERENCE_Msk (0x1UL << GRTC_CC_CCADD_REFERENCE_Pos) /*!< Bit mask of REFERENCE field.                 */
  #define GRTC_CC_CCADD_REFERENCE_Min (0x0UL)        /*!< Min enumerator value of REFERENCE field.                             */
  #define GRTC_CC_CCADD_REFERENCE_Max (0x1UL)        /*!< Max enumerator value of REFERENCE field.                             */
  #define GRTC_CC_CCADD_REFERENCE_SYSCOUNTER (0x0UL) /*!< Adds SYSCOUNTER value.                                               */
  #define GRTC_CC_CCADD_REFERENCE_CC (0x1UL)         /*!< Adds CC value.                                                       */


/* GRTC_CC_CCEN: Configure Capture/Compare register CC[n] */
  #define GRTC_CC_CCEN_ResetValue (0x00000000UL)     /*!< Reset value of CCEN register.                                        */

/* ACTIVE @Bit 0 : Configure the Capture/Compare register */
  #define GRTC_CC_CCEN_ACTIVE_Pos (0UL)              /*!< Position of ACTIVE field.                                            */
  #define GRTC_CC_CCEN_ACTIVE_Msk (0x1UL << GRTC_CC_CCEN_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.                            */
  #define GRTC_CC_CCEN_ACTIVE_Min (0x0UL)            /*!< Min enumerator value of ACTIVE field.                                */
  #define GRTC_CC_CCEN_ACTIVE_Max (0x1UL)            /*!< Max enumerator value of ACTIVE field.                                */
  #define GRTC_CC_CCEN_ACTIVE_Disable (0x0UL)        /*!< Capture/Compare register CC[n] Disabled.                             */
  #define GRTC_CC_CCEN_ACTIVE_Enable (0x1UL)         /*!< Capture/Compare register CC[n] enabled.                              */

/* PASTCC @Bit 1 : Status of event EVENTS_COMPARE[n] caused by the configured CC value is in past */
  #define GRTC_CC_CCEN_PASTCC_Pos (1UL)              /*!< Position of PASTCC field.                                            */
  #define GRTC_CC_CCEN_PASTCC_Msk (0x1UL << GRTC_CC_CCEN_PASTCC_Pos) /*!< Bit mask of PASTCC field.                            */
  #define GRTC_CC_CCEN_PASTCC_Min (0x0UL)            /*!< Min enumerator value of PASTCC field.                                */
  #define GRTC_CC_CCEN_PASTCC_Max (0x1UL)            /*!< Max enumerator value of PASTCC field.                                */
  #define GRTC_CC_CCEN_PASTCC_Inactive (0x0UL)       /*!< Inactive                                                             */
  #define GRTC_CC_CCEN_PASTCC_Active (0x1UL)         /*!< Active                                                               */



/* ================================================= Struct GRTC_SYSCOUNTER ================================================== */
/**
  * @brief SYSCOUNTER [GRTC_SYSCOUNTER] (unspecified)
  */
typedef struct {
  __IM  uint32_t  SYSCOUNTERL;                       /*!< (@ 0x00000000) The lower 32-bits of the SYSCOUNTER for index [n]     */
  __IM  uint32_t  SYSCOUNTERH;                       /*!< (@ 0x00000004) The higher 20-bits of the SYSCOUNTER for index [n]    */
  __IOM uint32_t  ACTIVE;                            /*!< (@ 0x00000008) Request to keep the SYSCOUNTER in the active state and
                                                                         prevent going to sleep for index [n]*/
  __IM  uint32_t  RESERVED;
} NRF_GRTC_SYSCOUNTER_Type;                          /*!< Size = 16 (0x010)                                                    */
  #define GRTC_SYSCOUNTER_MaxCount (4UL)             /*!< Size of SYSCOUNTER[4] array.                                         */
  #define GRTC_SYSCOUNTER_MaxIndex (3UL)             /*!< Max index of SYSCOUNTER[4] array.                                    */
  #define GRTC_SYSCOUNTER_MinIndex (0UL)             /*!< Min index of SYSCOUNTER[4] array.                                    */

/* GRTC_SYSCOUNTER_SYSCOUNTERL: The lower 32-bits of the SYSCOUNTER for index [n] */
  #define GRTC_SYSCOUNTER_SYSCOUNTERL_ResetValue (0x00000000UL) /*!< Reset value of SYSCOUNTERL register.                      */

/* VALUE @Bits 0..31 : The lower 32-bits of the SYSCOUNTER value. */
  #define GRTC_SYSCOUNTER_SYSCOUNTERL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                            */
  #define GRTC_SYSCOUNTER_SYSCOUNTERL_VALUE_Msk (0xFFFFFFFFUL << GRTC_SYSCOUNTER_SYSCOUNTERL_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/


/* GRTC_SYSCOUNTER_SYSCOUNTERH: The higher 20-bits of the SYSCOUNTER for index [n] */
  #define GRTC_SYSCOUNTER_SYSCOUNTERH_ResetValue (0x60000000UL) /*!< Reset value of SYSCOUNTERH register.                      */

