NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* ================================================== Struct MPC_MEMACCERR =================================================== */
/**
  * @brief MEMACCERR [MPC_MEMACCERR] Memory Access Error status registers
  */
typedef struct {
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Target Address of Memory Access Error. Register content
                                                                         won't be changed as long as MEMACCERR event is active.*/
  __IM  uint32_t  INFO;                              /*!< (@ 0x00000004) Access information for the transaction that triggered a
                                                                         memory access error. Register content won't be changed
                                                                         as long as MEMACCERR event is active.*/
} NRF_MPC_MEMACCERR_Type;                            /*!< Size = 8 (0x008)                                                     */

/* MPC_MEMACCERR_ADDRESS: Target Address of Memory Access Error. Register content won't be changed as long as MEMACCERR event is
                           active. */

  #define MPC_MEMACCERR_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                */

/* ADDRESS @Bits 0..31 : Target address for erroneous access */
  #define MPC_MEMACCERR_ADDRESS_ADDRESS_Pos (0UL)    /*!< Position of ADDRESS field.                                           */
  #define MPC_MEMACCERR_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MPC_MEMACCERR_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.*/


/* MPC_MEMACCERR_INFO: Access information for the transaction that triggered a memory access error. Register content won't be
                        changed as long as MEMACCERR event is active. */

  #define MPC_MEMACCERR_INFO_ResetValue (0x00000000UL) /*!< Reset value of INFO register.                                      */

/* READ @Bit 12 : Read bit of bus access */
  #define MPC_MEMACCERR_INFO_READ_Pos (12UL)         /*!< Position of READ field.                                              */
  #define MPC_MEMACCERR_INFO_READ_Msk (0x1UL << MPC_MEMACCERR_INFO_READ_Pos) /*!< Bit mask of READ field.                      */
  #define MPC_MEMACCERR_INFO_READ_Min (0x0UL)        /*!< Min enumerator value of READ field.                                  */
  #define MPC_MEMACCERR_INFO_READ_Max (0x1UL)        /*!< Max enumerator value of READ field.                                  */
  #define MPC_MEMACCERR_INFO_READ_Set (0x1UL)        /*!< Read access bit was set                                              */
  #define MPC_MEMACCERR_INFO_READ_NotSet (0x0UL)     /*!< Read access bit was not set                                          */

/* WRITE @Bit 13 : Write bit of bus access */
  #define MPC_MEMACCERR_INFO_WRITE_Pos (13UL)        /*!< Position of WRITE field.                                             */
  #define MPC_MEMACCERR_INFO_WRITE_Msk (0x1UL << MPC_MEMACCERR_INFO_WRITE_Pos) /*!< Bit mask of WRITE field.                   */
  #define MPC_MEMACCERR_INFO_WRITE_Min (0x0UL)       /*!< Min enumerator value of WRITE field.                                 */
  #define MPC_MEMACCERR_INFO_WRITE_Max (0x1UL)       /*!< Max enumerator value of WRITE field.                                 */
  #define MPC_MEMACCERR_INFO_WRITE_Set (0x1UL)       /*!< Write access bit was set                                             */
  #define MPC_MEMACCERR_INFO_WRITE_NotSet (0x0UL)    /*!< Write access bit was not set                                         */

/* EXECUTE @Bit 14 : Execute bit of bus access */
  #define MPC_MEMACCERR_INFO_EXECUTE_Pos (14UL)      /*!< Position of EXECUTE field.                                           */
  #define MPC_MEMACCERR_INFO_EXECUTE_Msk (0x1UL << MPC_MEMACCERR_INFO_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.             */
  #define MPC_MEMACCERR_INFO_EXECUTE_Min (0x0UL)     /*!< Min enumerator value of EXECUTE field.                               */
  #define MPC_MEMACCERR_INFO_EXECUTE_Max (0x1UL)     /*!< Max enumerator value of EXECUTE field.                               */
  #define MPC_MEMACCERR_INFO_EXECUTE_Set (0x1UL)     /*!< Execute access bit was set                                           */
  #define MPC_MEMACCERR_INFO_EXECUTE_NotSet (0x0UL)  /*!< Execute access bit was not set                                       */

/* SECURE @Bit 15 : Secure bit of bus access */
  #define MPC_MEMACCERR_INFO_SECURE_Pos (15UL)       /*!< Position of SECURE field.                                            */
  #define MPC_MEMACCERR_INFO_SECURE_Msk (0x1UL << MPC_MEMACCERR_INFO_SECURE_Pos) /*!< Bit mask of SECURE field.                */
  #define MPC_MEMACCERR_INFO_SECURE_Min (0x0UL)      /*!< Min enumerator value of SECURE field.                                */
  #define MPC_MEMACCERR_INFO_SECURE_Max (0x1UL)      /*!< Max enumerator value of SECURE field.                                */
  #define MPC_MEMACCERR_INFO_SECURE_Set (0x1UL)      /*!< Secure access bit was set                                            */
  #define MPC_MEMACCERR_INFO_SECURE_NotSet (0x0UL)   /*!< Secure access bit was not set                                        */

/* ERRORSOURCE @Bit 16 : Source of memory access error */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Pos (16UL)  /*!< Position of ERRORSOURCE field.                                       */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Msk (0x1UL << MPC_MEMACCERR_INFO_ERRORSOURCE_Pos) /*!< Bit mask of ERRORSOURCE field. */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Min (0x0UL) /*!< Min enumerator value of ERRORSOURCE field.                           */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Max (0x1UL) /*!< Max enumerator value of ERRORSOURCE field.                           */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_MPC (0x1UL) /*!< Error was triggered by MPC module                                    */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Slave (0x0UL) /*!< Error was triggered by a Subordinate                               */



/* =================================================== Struct MPC_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [MPC_OVERRIDE] Special privilege tables
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) Override region n Configuration register              */
  __IOM uint32_t  STARTADDR;                         /*!< (@ 0x00000004) Override region n Start Address                       */
  __IOM uint32_t  ENDADDR;                           /*!< (@ 0x00000008) Override region n End Address                         */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PERM;                              /*!< (@ 0x00000010) Permission settings for override region n             */
  __IOM uint32_t  PERMMASK;                          /*!< (@ 0x00000014) Masks permission setting fields from register
                                                                         OVERRIDE.PERM*/
  __IM  uint32_t  RESERVED1[2];
} NRF_MPC_OVERRIDE_Type;                             /*!< Size = 32 (0x020)                                                    */
  #define MPC_OVERRIDE_MaxCount (12UL)               /*!< Size of OVERRIDE[12] array.                                          */
  #define MPC_OVERRIDE_MaxIndex (11UL)               /*!< Max index of OVERRIDE[12] array.                                     */
  #define MPC_OVERRIDE_MinIndex (0UL)                /*!< Min index of OVERRIDE[12] array.                                     */

