NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* CTEINLINERXMODE2US @Bits 13..15 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos (13UL) /*!< Position of CTEINLINERXMODE2US field.                         */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Msk (0x7UL << RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos) /*!< Bit mask of
                                                                            CTEINLINERXMODE2US field.*/
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Min (0x1UL) /*!< Min enumerator value of CTEINLINERXMODE2US field.            */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Max (0x6UL) /*!< Max enumerator value of CTEINLINERXMODE2US field.            */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_4us (0x1UL) /*!< 4us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_2us (0x2UL) /*!< 2us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_1us (0x3UL) /*!< 1us                                                          */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_500ns (0x4UL) /*!< 0.5us                                                      */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_250ns (0x5UL) /*!< 0.25us                                                     */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_125ns (0x6UL) /*!< 0.125us                                                    */

/* S0CONF @Bits 16..23 : S0 bit pattern to match */
  #define RADIO_CTEINLINECONF_S0CONF_Pos (16UL)      /*!< Position of S0CONF field.                                            */
  #define RADIO_CTEINLINECONF_S0CONF_Msk (0xFFUL << RADIO_CTEINLINECONF_S0CONF_Pos) /*!< Bit mask of S0CONF field.             */

/* S0MASK @Bits 24..31 : S0 bit mask to set which bit to match */
  #define RADIO_CTEINLINECONF_S0MASK_Pos (24UL)      /*!< Position of S0MASK field.                                            */
  #define RADIO_CTEINLINECONF_S0MASK_Msk (0xFFUL << RADIO_CTEINLINECONF_S0MASK_Pos) /*!< Bit mask of S0MASK field.             */


/* RADIO_PACKETPTR: Packet pointer */
  #define RADIO_PACKETPTR_ResetValue (0x00000000UL)  /*!< Reset value of PACKETPTR register.                                   */

/* PTR @Bits 0..31 : Data pointer */
  #define RADIO_PACKETPTR_PTR_Pos (0UL)              /*!< Position of PTR field.                                               */
  #define RADIO_PACKETPTR_PTR_Msk (0xFFFFFFFFUL << RADIO_PACKETPTR_PTR_Pos) /*!< Bit mask of PTR field.                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        REGULATORS                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct REGULATORS_HIBERNATOR =============================================== */
/**
  * @brief HIBERNATOR [REGULATORS_HIBERNATOR] Hibernator interface
  */
typedef struct {
  __OM  uint32_t  SYSTEMHIBERNATE;                   /*!< (@ 0x00000000) Enter System hibernation mode for extreme low power
                                                                         consumption*/
  __IOM uint32_t  GPIORETENTIONRELEASE;              /*!< (@ 0x00000004) Release GPIO retention on wake up from hibernation
                                                                         mode.*/
  __IM  uint32_t  GPIORETENTIONSTATUS;               /*!< (@ 0x00000008) Read out if GPIO retention is active.                 */
} NRF_REGULATORS_HIBERNATOR_Type;                    /*!< Size = 12 (0x00C)                                                    */

/* REGULATORS_HIBERNATOR_SYSTEMHIBERNATE: Enter System hibernation mode for extreme low power consumption */
  #define REGULATORS_HIBERNATOR_SYSTEMHIBERNATE_ResetValue (0x00000000UL) /*!< Reset value of SYSTEMHIBERNATE register.        */

/* SYSTEMHIBERNATE @Bit 0 : Enter hibernation mode */
  #define REGULATORS_HIBERNATOR_SYSTEMHIBERNATE_SYSTEMHIBERNATE_Pos (0UL) /*!< Position of SYSTEMHIBERNATE field.              */
  #define REGULATORS_HIBERNATOR_SYSTEMHIBERNATE_SYSTEMHIBERNATE_Msk (0x1UL << REGULATORS_HIBERNATOR_SYSTEMHIBERNATE_SYSTEMHIBERNATE_Pos)
                                                                            /*!< Bit mask of SYSTEMHIBERNATE field.*/
  #define REGULATORS_HIBERNATOR_SYSTEMHIBERNATE_SYSTEMHIBERNATE_Min (0x1UL) /*!< Min enumerator value of SYSTEMHIBERNATE field.*/
  #define REGULATORS_HIBERNATOR_SYSTEMHIBERNATE_SYSTEMHIBERNATE_Max (0x1UL) /*!< Max enumerator value of SYSTEMHIBERNATE field.*/
  #define REGULATORS_HIBERNATOR_SYSTEMHIBERNATE_SYSTEMHIBERNATE_Enter (0x1UL) /*!< Enter hibernation mode                      */


/* REGULATORS_HIBERNATOR_GPIORETENTIONRELEASE: Release GPIO retention on wake up from hibernation mode. */
  #define REGULATORS_HIBERNATOR_GPIORETENTIONRELEASE_ResetValue (0x00000000UL) /*!< Reset value of GPIORETENTIONRELEASE
                                                                            register.*/

/* GPIORETENTIONRELEASE @Bit 0 : Release GPIO retention */
  #define REGULATORS_HIBERNATOR_GPIORETENTIONRELEASE_GPIORETENTIONRELEASE_Pos (0UL) /*!< Position of GPIORETENTIONRELEASE
                                                                            field.*/
  #define REGULATORS_HIBERNATOR_GPIORETENTIONRELEASE_GPIORETENTIONRELEASE_Msk (0x1UL << REGULATORS_HIBERNATOR_GPIORETENTIONRELEASE_GPIORETENTIONRELEASE_Pos)
                                                                            /*!< Bit mask of GPIORETENTIONRELEASE field.*/
  #define REGULATORS_HIBERNATOR_GPIORETENTIONRELEASE_GPIORETENTIONRELEASE_Min (0x0UL) /*!< Min enumerator value of
                                                                            GPIORETENTIONRELEASE field.*/
  #define REGULATORS_HIBERNATOR_GPIORETENTIONRELEASE_GPIORETENTIONRELEASE_Max (0x1UL) /*!< Max enumerator value of
                                                                            GPIORETENTIONRELEASE field.*/
  #define REGULATORS_HIBERNATOR_GPIORETENTIONRELEASE_GPIORETENTIONRELEASE_NoRelease (0x0UL) /*!< Do not release retention      */
  #define REGULATORS_HIBERNATOR_GPIORETENTIONRELEASE_GPIORETENTIONRELEASE_Release (0x1UL) /*!< Release retention               */


/* REGULATORS_HIBERNATOR_GPIORETENTIONSTATUS: Read out if GPIO retention is active. */
  #define REGULATORS_HIBERNATOR_GPIORETENTIONSTATUS_ResetValue (0x00000000UL) /*!< Reset value of GPIORETENTIONSTATUS register.*/

/* GPIORETENTIONSTATUS @Bit 0 : Read out if GPIO retention is active. */
  #define REGULATORS_HIBERNATOR_GPIORETENTIONSTATUS_GPIORETENTIONSTATUS_Pos (0UL) /*!< Position of GPIORETENTIONSTATUS field.  */
  #define REGULATORS_HIBERNATOR_GPIORETENTIONSTATUS_GPIORETENTIONSTATUS_Msk (0x1UL << REGULATORS_HIBERNATOR_GPIORETENTIONSTATUS_GPIORETENTIONSTATUS_Pos)
                                                                            /*!< Bit mask of GPIORETENTIONSTATUS field.*/
  #define REGULATORS_HIBERNATOR_GPIORETENTIONSTATUS_GPIORETENTIONSTATUS_Min (0x0UL) /*!< Min enumerator value of
                                                                            GPIORETENTIONSTATUS field.*/
  #define REGULATORS_HIBERNATOR_GPIORETENTIONSTATUS_GPIORETENTIONSTATUS_Max (0x1UL) /*!< Max enumerator value of
                                                                            GPIORETENTIONSTATUS field.*/
  #define REGULATORS_HIBERNATOR_GPIORETENTIONSTATUS_GPIORETENTIONSTATUS_NotActive (0x0UL) /*!< GPIO retention is not active.   */
  #define REGULATORS_HIBERNATOR_GPIORETENTIONSTATUS_GPIORETENTIONSTATUS_Active (0x1UL) /*!< GPIO retention is active.          */



/* =============================================== Struct REGULATORS_VREGMAIN ================================================ */
/**
  * @brief VREGMAIN [REGULATORS_VREGMAIN] Register interface for main voltage regulator.
  */
typedef struct {
  __IOM uint32_t  DCDCEN;                            /*!< (@ 0x00000000) Enable DC/DC converter for better power efficiency    */
  __IM  uint32_t  INDUCTORDET;                       /*!< (@ 0x00000004) VREGMAIN inductor detection                           */
} NRF_REGULATORS_VREGMAIN_Type;                      /*!< Size = 8 (0x008)                                                     */

/* REGULATORS_VREGMAIN_DCDCEN: Enable DC/DC converter for better power efficiency */
  #define REGULATORS_VREGMAIN_DCDCEN_ResetValue (0x00000000UL) /*!< Reset value of DCDCEN register.                            */

