NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* CH7LIMITH @Bit 20 : Write '1' to enable interrupt for event CH7LIMITH */
  #define SAADC_INTENSET_CH7LIMITH_Pos (20UL)        /*!< Position of CH7LIMITH field.                                         */
  #define SAADC_INTENSET_CH7LIMITH_Msk (0x1UL << SAADC_INTENSET_CH7LIMITH_Pos) /*!< Bit mask of CH7LIMITH field.               */
  #define SAADC_INTENSET_CH7LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH7LIMITH field.                             */
  #define SAADC_INTENSET_CH7LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH7LIMITH field.                             */
  #define SAADC_INTENSET_CH7LIMITH_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH7LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH7LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH7LIMITL @Bit 21 : Write '1' to enable interrupt for event CH7LIMITL */
  #define SAADC_INTENSET_CH7LIMITL_Pos (21UL)        /*!< Position of CH7LIMITL field.                                         */
  #define SAADC_INTENSET_CH7LIMITL_Msk (0x1UL << SAADC_INTENSET_CH7LIMITL_Pos) /*!< Bit mask of CH7LIMITL field.               */
  #define SAADC_INTENSET_CH7LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH7LIMITL field.                             */
  #define SAADC_INTENSET_CH7LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH7LIMITL field.                             */
  #define SAADC_INTENSET_CH7LIMITL_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH7LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH7LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* SAADC_INTENCLR: Disable interrupt */
  #define SAADC_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* STARTED @Bit 0 : Write '1' to disable interrupt for event STARTED */
  #define SAADC_INTENCLR_STARTED_Pos (0UL)           /*!< Position of STARTED field.                                           */
  #define SAADC_INTENCLR_STARTED_Msk (0x1UL << SAADC_INTENCLR_STARTED_Pos) /*!< Bit mask of STARTED field.                     */
  #define SAADC_INTENCLR_STARTED_Min (0x0UL)         /*!< Min enumerator value of STARTED field.                               */
  #define SAADC_INTENCLR_STARTED_Max (0x1UL)         /*!< Max enumerator value of STARTED field.                               */
  #define SAADC_INTENCLR_STARTED_Clear (0x1UL)       /*!< Disable                                                              */
  #define SAADC_INTENCLR_STARTED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_STARTED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* END @Bit 1 : Write '1' to disable interrupt for event END */
  #define SAADC_INTENCLR_END_Pos (1UL)               /*!< Position of END field.                                               */
  #define SAADC_INTENCLR_END_Msk (0x1UL << SAADC_INTENCLR_END_Pos) /*!< Bit mask of END field.                                 */
  #define SAADC_INTENCLR_END_Min (0x0UL)             /*!< Min enumerator value of END field.                                   */
  #define SAADC_INTENCLR_END_Max (0x1UL)             /*!< Max enumerator value of END field.                                   */
  #define SAADC_INTENCLR_END_Clear (0x1UL)           /*!< Disable                                                              */
  #define SAADC_INTENCLR_END_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_END_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* DONE @Bit 2 : Write '1' to disable interrupt for event DONE */
  #define SAADC_INTENCLR_DONE_Pos (2UL)              /*!< Position of DONE field.                                              */
  #define SAADC_INTENCLR_DONE_Msk (0x1UL << SAADC_INTENCLR_DONE_Pos) /*!< Bit mask of DONE field.                              */
  #define SAADC_INTENCLR_DONE_Min (0x0UL)            /*!< Min enumerator value of DONE field.                                  */
  #define SAADC_INTENCLR_DONE_Max (0x1UL)            /*!< Max enumerator value of DONE field.                                  */
  #define SAADC_INTENCLR_DONE_Clear (0x1UL)          /*!< Disable                                                              */
  #define SAADC_INTENCLR_DONE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_DONE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* RESULTDONE @Bit 3 : Write '1' to disable interrupt for event RESULTDONE */
  #define SAADC_INTENCLR_RESULTDONE_Pos (3UL)        /*!< Position of RESULTDONE field.                                        */
  #define SAADC_INTENCLR_RESULTDONE_Msk (0x1UL << SAADC_INTENCLR_RESULTDONE_Pos) /*!< Bit mask of RESULTDONE field.            */
  #define SAADC_INTENCLR_RESULTDONE_Min (0x0UL)      /*!< Min enumerator value of RESULTDONE field.                            */
  #define SAADC_INTENCLR_RESULTDONE_Max (0x1UL)      /*!< Max enumerator value of RESULTDONE field.                            */
  #define SAADC_INTENCLR_RESULTDONE_Clear (0x1UL)    /*!< Disable                                                              */
  #define SAADC_INTENCLR_RESULTDONE_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_RESULTDONE_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* CALIBRATEDONE @Bit 4 : Write '1' to disable interrupt for event CALIBRATEDONE */
  #define SAADC_INTENCLR_CALIBRATEDONE_Pos (4UL)     /*!< Position of CALIBRATEDONE field.                                     */
  #define SAADC_INTENCLR_CALIBRATEDONE_Msk (0x1UL << SAADC_INTENCLR_CALIBRATEDONE_Pos) /*!< Bit mask of CALIBRATEDONE field.   */
  #define SAADC_INTENCLR_CALIBRATEDONE_Min (0x0UL)   /*!< Min enumerator value of CALIBRATEDONE field.                         */
  #define SAADC_INTENCLR_CALIBRATEDONE_Max (0x1UL)   /*!< Max enumerator value of CALIBRATEDONE field.                         */
  #define SAADC_INTENCLR_CALIBRATEDONE_Clear (0x1UL) /*!< Disable                                                              */
  #define SAADC_INTENCLR_CALIBRATEDONE_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define SAADC_INTENCLR_CALIBRATEDONE_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* STOPPED @Bit 5 : Write '1' to disable interrupt for event STOPPED */
  #define SAADC_INTENCLR_STOPPED_Pos (5UL)           /*!< Position of STOPPED field.                                           */
  #define SAADC_INTENCLR_STOPPED_Msk (0x1UL << SAADC_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                     */
  #define SAADC_INTENCLR_STOPPED_Min (0x0UL)         /*!< Min enumerator value of STOPPED field.                               */
  #define SAADC_INTENCLR_STOPPED_Max (0x1UL)         /*!< Max enumerator value of STOPPED field.                               */
  #define SAADC_INTENCLR_STOPPED_Clear (0x1UL)       /*!< Disable                                                              */
  #define SAADC_INTENCLR_STOPPED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_STOPPED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* CH0LIMITH @Bit 6 : Write '1' to disable interrupt for event CH0LIMITH */
  #define SAADC_INTENCLR_CH0LIMITH_Pos (6UL)         /*!< Position of CH0LIMITH field.                                         */
  #define SAADC_INTENCLR_CH0LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH0LIMITH_Pos) /*!< Bit mask of CH0LIMITH field.               */
  #define SAADC_INTENCLR_CH0LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH0LIMITH field.                             */
  #define SAADC_INTENCLR_CH0LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH0LIMITH field.                             */
  #define SAADC_INTENCLR_CH0LIMITH_Clear (0x1UL)     /*!< Disable                                                              */
  #define SAADC_INTENCLR_CH0LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_CH0LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH0LIMITL @Bit 7 : Write '1' to disable interrupt for event CH0LIMITL */
  #define SAADC_INTENCLR_CH0LIMITL_Pos (7UL)         /*!< Position of CH0LIMITL field.                                         */
  #define SAADC_INTENCLR_CH0LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH0LIMITL_Pos) /*!< Bit mask of CH0LIMITL field.               */
  #define SAADC_INTENCLR_CH0LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH0LIMITL field.                             */
  #define SAADC_INTENCLR_CH0LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH0LIMITL field.                             */
  #define SAADC_INTENCLR_CH0LIMITL_Clear (0x1UL)     /*!< Disable                                                              */
  #define SAADC_INTENCLR_CH0LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENCLR_CH0LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

