NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* SPIS_SEMSTAT: Semaphore status register */
  #define SPIS_SEMSTAT_ResetValue (0x00000001UL)     /*!< Reset value of SEMSTAT register.                                     */

/* SEMSTAT @Bits 0..1 : Semaphore status */
  #define SPIS_SEMSTAT_SEMSTAT_Pos (0UL)             /*!< Position of SEMSTAT field.                                           */
  #define SPIS_SEMSTAT_SEMSTAT_Msk (0x3UL << SPIS_SEMSTAT_SEMSTAT_Pos) /*!< Bit mask of SEMSTAT field.                         */
  #define SPIS_SEMSTAT_SEMSTAT_Min (0x0UL)           /*!< Min enumerator value of SEMSTAT field.                               */
  #define SPIS_SEMSTAT_SEMSTAT_Max (0x3UL)           /*!< Max enumerator value of SEMSTAT field.                               */
  #define SPIS_SEMSTAT_SEMSTAT_Free (0x0UL)          /*!< Semaphore is free                                                    */
  #define SPIS_SEMSTAT_SEMSTAT_CPU (0x1UL)           /*!< Semaphore is assigned to CPU                                         */
  #define SPIS_SEMSTAT_SEMSTAT_SPIS (0x2UL)          /*!< Semaphore is assigned to SPI slave                                   */
  #define SPIS_SEMSTAT_SEMSTAT_CPUPending (0x3UL)    /*!< Semaphore is assigned to SPI but a handover to the CPU is pending    */


/* SPIS_STATUS: Status from last transaction */
  #define SPIS_STATUS_ResetValue (0x00000000UL)      /*!< Reset value of STATUS register.                                      */

/* OVERREAD @Bit 0 : TX buffer over-read detected, and prevented */
  #define SPIS_STATUS_OVERREAD_Pos (0UL)             /*!< Position of OVERREAD field.                                          */
  #define SPIS_STATUS_OVERREAD_Msk (0x1UL << SPIS_STATUS_OVERREAD_Pos) /*!< Bit mask of OVERREAD field.                        */
  #define SPIS_STATUS_OVERREAD_Min (0x0UL)           /*!< Min enumerator value of OVERREAD field.                              */
  #define SPIS_STATUS_OVERREAD_Max (0x1UL)           /*!< Max enumerator value of OVERREAD field.                              */
  #define SPIS_STATUS_OVERREAD_NotPresent (0x0UL)    /*!< Read: error not present                                              */
  #define SPIS_STATUS_OVERREAD_Present (0x1UL)       /*!< Read: error present                                                  */
  #define SPIS_STATUS_OVERREAD_Clear (0x1UL)         /*!< Write: clear error on writing '1'                                    */

/* OVERFLOW @Bit 1 : RX buffer overflow detected, and prevented */
  #define SPIS_STATUS_OVERFLOW_Pos (1UL)             /*!< Position of OVERFLOW field.                                          */
  #define SPIS_STATUS_OVERFLOW_Msk (0x1UL << SPIS_STATUS_OVERFLOW_Pos) /*!< Bit mask of OVERFLOW field.                        */
  #define SPIS_STATUS_OVERFLOW_Min (0x0UL)           /*!< Min enumerator value of OVERFLOW field.                              */
  #define SPIS_STATUS_OVERFLOW_Max (0x1UL)           /*!< Max enumerator value of OVERFLOW field.                              */
  #define SPIS_STATUS_OVERFLOW_NotPresent (0x0UL)    /*!< Read: error not present                                              */
  #define SPIS_STATUS_OVERFLOW_Present (0x1UL)       /*!< Read: error present                                                  */
  #define SPIS_STATUS_OVERFLOW_Clear (0x1UL)         /*!< Write: clear error on writing '1'                                    */


/* SPIS_ENABLE: Enable SPI slave */
  #define SPIS_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..3 : Enable or disable SPI slave */
  #define SPIS_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define SPIS_ENABLE_ENABLE_Msk (0xFUL << SPIS_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define SPIS_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define SPIS_ENABLE_ENABLE_Max (0x2UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define SPIS_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable SPI slave                                                    */
  #define SPIS_ENABLE_ENABLE_Enabled (0x2UL)         /*!< Enable SPI slave                                                     */


/* SPIS_CONFIG: Configuration register */
  #define SPIS_CONFIG_ResetValue (0x00000000UL)      /*!< Reset value of CONFIG register.                                      */

/* ORDER @Bit 0 : Bit order */
  #define SPIS_CONFIG_ORDER_Pos (0UL)                /*!< Position of ORDER field.                                             */
  #define SPIS_CONFIG_ORDER_Msk (0x1UL << SPIS_CONFIG_ORDER_Pos) /*!< Bit mask of ORDER field.                                 */
  #define SPIS_CONFIG_ORDER_Min (0x0UL)              /*!< Min enumerator value of ORDER field.                                 */
  #define SPIS_CONFIG_ORDER_Max (0x1UL)              /*!< Max enumerator value of ORDER field.                                 */
  #define SPIS_CONFIG_ORDER_MsbFirst (0x0UL)         /*!< Most significant bit shifted out first                               */
  #define SPIS_CONFIG_ORDER_LsbFirst (0x1UL)         /*!< Least significant bit shifted out first                              */

/* CPHA @Bit 1 : Serial clock (SCK) phase */
  #define SPIS_CONFIG_CPHA_Pos (1UL)                 /*!< Position of CPHA field.                                              */
  #define SPIS_CONFIG_CPHA_Msk (0x1UL << SPIS_CONFIG_CPHA_Pos) /*!< Bit mask of CPHA field.                                    */
  #define SPIS_CONFIG_CPHA_Min (0x0UL)               /*!< Min enumerator value of CPHA field.                                  */
  #define SPIS_CONFIG_CPHA_Max (0x1UL)               /*!< Max enumerator value of CPHA field.                                  */
  #define SPIS_CONFIG_CPHA_Leading (0x0UL)           /*!< Sample on leading edge of clock, shift serial data on trailing edge  */
  #define SPIS_CONFIG_CPHA_Trailing (0x1UL)          /*!< Sample on trailing edge of clock, shift serial data on leading edge  */

