NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN8_Pos (8UL)            /*!< Position of PIN8 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN8_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN8_Pos) /*!< Bit mask of PIN8 field.                          */
  #define VPRCSR_NORDIC_IN_PIN8_Min (0x0UL)          /*!< Min enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN8_Max (0x1UL)          /*!< Max enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN8_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN8_HIGH (0x1UL)         /*!< Pin is High                                                          */

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN9_Pos (9UL)            /*!< Position of PIN9 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN9_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN9_Pos) /*!< Bit mask of PIN9 field.                          */
  #define VPRCSR_NORDIC_IN_PIN9_Min (0x0UL)          /*!< Min enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN9_Max (0x1UL)          /*!< Max enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN9_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN9_HIGH (0x1UL)         /*!< Pin is High                                                          */

/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN10_Pos (10UL)          /*!< Position of PIN10 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN10_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN10_Pos) /*!< Bit mask of PIN10 field.                       */
  #define VPRCSR_NORDIC_IN_PIN10_Min (0x0UL)         /*!< Min enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN10_Max (0x1UL)         /*!< Max enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN10_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN10_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN11_Pos (11UL)          /*!< Position of PIN11 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN11_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN11_Pos) /*!< Bit mask of PIN11 field.                       */
  #define VPRCSR_NORDIC_IN_PIN11_Min (0x0UL)         /*!< Min enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN11_Max (0x1UL)         /*!< Max enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN11_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN11_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN12_Pos (12UL)          /*!< Position of PIN12 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN12_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN12_Pos) /*!< Bit mask of PIN12 field.                       */
  #define VPRCSR_NORDIC_IN_PIN12_Min (0x0UL)         /*!< Min enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN12_Max (0x1UL)         /*!< Max enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN12_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN12_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN13_Pos (13UL)          /*!< Position of PIN13 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN13_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN13_Pos) /*!< Bit mask of PIN13 field.                       */
  #define VPRCSR_NORDIC_IN_PIN13_Min (0x0UL)         /*!< Min enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN13_Max (0x1UL)         /*!< Max enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN13_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN13_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN14_Pos (14UL)          /*!< Position of PIN14 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN14_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN14_Pos) /*!< Bit mask of PIN14 field.                       */
  #define VPRCSR_NORDIC_IN_PIN14_Min (0x0UL)         /*!< Min enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN14_Max (0x1UL)         /*!< Max enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN14_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN14_HIGH (0x1UL)        /*!< Pin is High                                                          */

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN15_Pos (15UL)          /*!< Position of PIN15 field.                                             */
  #define VPRCSR_NORDIC_IN_PIN15_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN15_Pos) /*!< Bit mask of PIN15 field.                       */
  #define VPRCSR_NORDIC_IN_PIN15_Min (0x0UL)         /*!< Min enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN15_Max (0x1UL)         /*!< Max enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_IN_PIN15_LOW (0x0UL)         /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN15_HIGH (0x1UL)        /*!< Pin is High                                                          */


/**
  * @brief INMODE [VPRCSR_NORDIC_INMODE] Input Mode
  */
  #define VPRCSR_NORDIC_INMODE (0x00000BC3ul)
  #define VPRCSR_NORDIC_INMODE_ResetValue (0x00000000UL) /*!< Reset value of INMODE register.                                  */

/* MODE @Bits 0..1 : Input Mode */
  #define VPRCSR_NORDIC_INMODE_MODE_Pos (0UL)        /*!< Position of MODE field.                                              */
  #define VPRCSR_NORDIC_INMODE_MODE_Msk (0x3UL << VPRCSR_NORDIC_INMODE_MODE_Pos) /*!< Bit mask of MODE field.                  */
  #define VPRCSR_NORDIC_INMODE_MODE_Min (0x0UL)      /*!< Min enumerator value of MODE field.                                  */
  #define VPRCSR_NORDIC_INMODE_MODE_Max (0x3UL)      /*!< Max enumerator value of MODE field.                                  */
  #define VPRCSR_NORDIC_INMODE_MODE_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)                       */
  #define VPRCSR_NORDIC_INMODE_MODE_EVENT (0x1UL)    /*!< Sampling on Counter1 event                                           */
  #define VPRCSR_NORDIC_INMODE_MODE_SHIFT (0x2UL)    /*!< Sampling and shifting on Counter1 event synchronized with OUT        */
  #define VPRCSR_NORDIC_INMODE_MODE_SHIFTA (0x3UL)   /*!< Sampling and shifting on Counter1 event, independent of OUT          */


/**
  * @brief OUTB [VPRCSR_NORDIC_OUTB] Buffered GPIO Output
  */
  #define VPRCSR_NORDIC_OUTB (0x00000BC4ul)
  #define VPRCSR_NORDIC_OUTB_ResetValue (0x00000000UL) /*!< Reset value of OUTB register.                                      */

