NordicSemiconductor/nrfx/mdk/nrf54l09_enga_types.h
/* OUT @Bits 0..15 : Written to OUT MSBs that are not driven by OUTB shifting. */
  #define VPRCSR_NORDIC_OUTUB_OUT_Pos (0UL)          /*!< Position of OUT field.                                               */
  #define VPRCSR_NORDIC_OUTUB_OUT_Msk (0xFFFFUL << VPRCSR_NORDIC_OUTUB_OUT_Pos) /*!< Bit mask of OUT field.                    */


/**
  * @brief SHIFTCNTCOMP [VPRCSR_NORDIC_SHIFTCNTCOMP] SHIFTCNTIN/OUT compare values
  */
  #define VPRCSR_NORDIC_SHIFTCNTCOMP (0x00000BE8ul)
  #define VPRCSR_NORDIC_SHIFTCNTCOMP_ResetValue (0x00000000UL) /*!< Reset value of SHIFTCNTCOMP register.                      */

/* OUTCOMPVAL @Bits 0..5 : Compare value for SHIFTCNTOUT */
  #define VPRCSR_NORDIC_SHIFTCNTCOMP_OUTCOMPVAL_Pos (0UL) /*!< Position of OUTCOMPVAL field.                                   */
  #define VPRCSR_NORDIC_SHIFTCNTCOMP_OUTCOMPVAL_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCNTCOMP_OUTCOMPVAL_Pos) /*!< Bit mask of
                                                                            OUTCOMPVAL field.*/

/* INCOMPVAL @Bits 8..13 : Compare value for SHIFTCNTIN */
  #define VPRCSR_NORDIC_SHIFTCNTCOMP_INCOMPVAL_Pos (8UL) /*!< Position of INCOMPVAL field.                                     */
  #define VPRCSR_NORDIC_SHIFTCNTCOMP_INCOMPVAL_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCNTCOMP_INCOMPVAL_Pos) /*!< Bit mask of
                                                                            INCOMPVAL field.*/


/**
  * @brief WAITEVENT [VPRCSR_NORDIC_WAITEVENT] Wait for internal event
  */
  #define VPRCSR_NORDIC_WAITEVENT (0x00000BE9ul)
  #define VPRCSR_NORDIC_WAITEVENT_ResetValue (0x00000000UL) /*!< Reset value of WAITEVENT register.                            */

/* IEVENTCNT0 @Bit 0 : CNT0's event */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTCNT0_Pos (0UL) /*!< Position of IEVENTCNT0 field.                                      */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTCNT0_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTCNT0_Pos) /*!< Bit mask of IEVENTCNT0
                                                                            field.*/

/* IEVENTCNT1 @Bit 1 : CNT1's event */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTCNT1_Pos (1UL) /*!< Position of IEVENTCNT1 field.                                      */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTCNT1_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTCNT1_Pos) /*!< Bit mask of IEVENTCNT1
                                                                            field.*/

/* IEVENTVIO @Bit 2 : Event generated by a specific VIO pin */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVIO_Pos (2UL) /*!< Position of IEVENTVIO field.                                        */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVIO_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTVIO_Pos) /*!< Bit mask of IEVENTVIO
                                                                            field.*/

/* IEVENTVIOANY @Bit 3 : Event generated by a change in any VIO pin */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVIOANY_Pos (3UL) /*!< Position of IEVENTVIOANY field.                                  */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVIOANY_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTVIOANY_Pos) /*!< Bit mask of
                                                                            IEVENTVIOANY field.*/

/* IEVENTVTASKSANY @Bit 4 : Event when any TASK is triggered */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVTASKSANY_Pos (4UL) /*!< Position of IEVENTVTASKSANY field.                            */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTVTASKSANY_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTVTASKSANY_Pos) /*!< Bit mask of
                                                                            IEVENTVTASKSANY field.*/

/* IEVENTSHIFTCNTOUT @Bit 5 : Event for SHIFTCNTOUT when reaching a compare value defined in SHIFTCNTCOMP */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTOUT_Pos (5UL) /*!< Position of IEVENTSHIFTCNTOUT field.                        */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTOUT_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTOUT_Pos) /*!< Bit mask
                                                                            of IEVENTSHIFTCNTOUT field.*/

/* IEVENTSHIFTCNTIN @Bit 6 : Event for SHIFTCNTIN when reaching a compare value defined in SHIFTCNTCOMP */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTIN_Pos (6UL) /*!< Position of IEVENTSHIFTCNTIN field.                          */
  #define VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTIN_Msk (0x1UL << VPRCSR_NORDIC_WAITEVENT_IEVENTSHIFTCNTIN_Pos) /*!< Bit mask of
                                                                            IEVENTSHIFTCNTIN field.*/


/**
  * @brief WAITINPUT [VPRCSR_NORDIC_WAITINPUT] Wait input
  */
  #define VPRCSR_NORDIC_WAITINPUT (0x00000BEAul)
  #define VPRCSR_NORDIC_WAITINPUT_ResetValue (0x00000000UL) /*!< Reset value of WAITINPUT register.                            */

/* VTASKSVIO @Bits 0..31 : VTASKS or VIO pins */
  #define VPRCSR_NORDIC_WAITINPUT_VTASKSVIO_Pos (0UL) /*!< Position of VTASKSVIO field.                                        */
  #define VPRCSR_NORDIC_WAITINPUT_VTASKSVIO_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_WAITINPUT_VTASKSVIO_Pos) /*!< Bit mask of
                                                                            VTASKSVIO field.*/


/**
  * @brief RTPINTEN [VPRCSR_NORDIC_RTPINTEN] Interrupt enable
  */
  #define VPRCSR_NORDIC_RTPINTEN (0x00000BEBul)
  #define VPRCSR_NORDIC_RTPINTEN_ResetValue (0x00000000UL) /*!< Reset value of RTPINTEN register.                              */

/* CNT0 @Bit 0 : Interrupt enable for IEVENTCNT0, alias of VPRNORDICCTRL.CNTIRQENABLE */
  #define VPRCSR_NORDIC_RTPINTEN_CNT0_Pos (0UL)      /*!< Position of CNT0 field.                                              */
  #define VPRCSR_NORDIC_RTPINTEN_CNT0_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_CNT0_Pos) /*!< Bit mask of CNT0 field.              */

/* CNT1 @Bit 1 : Interrupt enable for IEVENTCNT1 */
  #define VPRCSR_NORDIC_RTPINTEN_CNT1_Pos (1UL)      /*!< Position of CNT1 field.                                              */
  #define VPRCSR_NORDIC_RTPINTEN_CNT1_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_CNT1_Pos) /*!< Bit mask of CNT1 field.              */

/* VIO @Bit 2 : Interrupt enable for IEVENTVIO */
  #define VPRCSR_NORDIC_RTPINTEN_VIO_Pos (2UL)       /*!< Position of VIO field.                                               */
  #define VPRCSR_NORDIC_RTPINTEN_VIO_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_VIO_Pos) /*!< Bit mask of VIO field.                 */

